Repository: vogon1/immich-wordpress-plugin
Catalog: languages/gallery-for-immich-*.po
Languages: de_de, fr_fr, nl_nl

source: Gallery for Immich
de_de: Galerie für Immich
fr_fr: Galerie pour Immich
nl_nl: Galerij voor Immich

source: Show Immich albums and photos in a WordPress site. Requires Immich server with API access.
de_de: Zeigen Sie Immich-Alben und Fotos auf einer WordPress-Website mit Shortcodes an. Erfordert Immich-Server mit API-Zugriff.
fr_fr: Affichez les albums et photos Immich sur un site WordPress à l'aide de shortcodes. Nécessite un serveur Immich avec accès API.
nl_nl: Toon Immich albums en foto's in een WordPress site met behulp van shortcodes. Vereist Immich server met API toegang.

source: Show Immich albums and photos in a WordPress site using shortcodes. Requires Immich server with API access.
de_de: Zeigen Sie Immich-Alben und Fotos auf einer WordPress-Website mit Shortcodes an. Erfordert Immich-Server mit API-Zugriff.
fr_fr: Affichez les albums et photos Immich sur un site WordPress à l'aide de shortcodes. Nécessite un serveur Immich avec accès API.
nl_nl: Toon Immich albums en foto's in een WordPress site met behulp van shortcodes. Vereist Immich server met API toegang.

source: Settings
de_de: Einstellungen
fr_fr: Paramètres
nl_nl: Instellingen

source: API Key
de_de: API-Schlüssel
fr_fr: Clé API
nl_nl: API-sleutel

source: Video playback
de_de: Videowiedergabe
fr_fr: Lecture vidéo
nl_nl: Video afspelen

source: Server URL must use HTTPS (or localhost for development).
de_de: Server-URL muss HTTPS verwenden (oder localhost für Entwicklung).
fr_fr: L'URL du serveur doit utiliser HTTPS (ou localhost pour le développement).
nl_nl: Server URL moet HTTPS gebruiken (of localhost voor ontwikkeling).

source: API Key contains invalid characters.
de_de: API-Schlüssel enthält ungültige Zeichen.
fr_fr: La clé API contient des caractères non valides.
nl_nl: API-sleutel bevat ongeldige tekens.

source: Shared links (default)
de_de: Geteilte Links (Standard)
fr_fr: Liens partagés (par défaut)
nl_nl: Shared links (standaard)

source: Proxy via fopen
de_de: Proxy über fopen

source: Ignore videos
de_de: Videos ignorieren
fr_fr: Ignorer les vidéos
nl_nl: Video's negeren

source: How it works:
de_de: So funktioniert es:
fr_fr: Comment ça marche :
nl_nl: Hoe het werkt:

source: Proxy via fopen: Streams videos through this WordPress site. Most elegant, but not all WordPress configurations support fopen. If it does not work for you, choose Shared Links.
de_de: Proxy über fopen: streamt Videos über diese WordPress-Website. Am elegantesten, aber nicht alle WordPress-Konfigurationen unterstützen fopen. Wenn es nicht für Sie funktioniert, wählen Sie Freigegebene Links.
fr_fr: Proxy via fopen : diffuse les vidéos via ce site WordPress. Le plus élégant, mais toutes les configurations WordPress ne supportent pas fopen. Si cela ne fonctionne pas pour vous, choisissez Liens partagés.
nl_nl: Proxy via fopen: streamt video's via deze WordPress site. Meest elegant, maar niet alle WordPress-configuraties ondersteunen fopen. Als het niet voor u werkt, kies Shared Links.

source: Shared links: Creates temporary shared links on Immich (bypasses WordPress server). The temporary links expire after a short period and will be removed from Immich.
de_de: Freigegebene Links: erstellt temporäre freigegebene Links auf Immich (umgeht die WordPress-Server). Die temporären Links verfallen nach kurzer Zeit und werden aus Immich entfernt.
fr_fr: Liens partagés : crée des liens partagés temporaires sur Immich (contourne le serveur WordPress). Les liens temporaires expirent après une courte période et seront supprimés d'Immich.
nl_nl: Shared links: creëert tijdelijke gedeelde links op Immich (omzeilt WordPress-server). De tijdelijke links verlopen na korte tijd en worden uit Immich verwijderd.

source: Ignore videos: Videos will not be displayed in galleries.
de_de: Videos ignorieren: Videos werden nicht in Galerien angezeigt.
fr_fr: Ignorer les vidéos : les vidéos ne seront pas affichées dans les galeries.
nl_nl: Video's negeren: video's worden niet weergegeven in galerijen.

source: You do not have sufficient permissions to access this page.
de_de: Sie haben nicht die erforderlichen Berechtigungen, um auf diese Seite zuzugreifen.
fr_fr: Vous n'avez pas les autorisations suffisantes pour accéder à cette page.
nl_nl: Je hebt onvoldoende rechten om deze pagina te bekijken.

source: Plugin not configured. Please set Server URL and API Key in settings.
de_de: Plugin nicht konfiguriert. Bitte legen Sie Server-URL und API-Schlüssel in den Einstellungen fest.
fr_fr: Plugin non configuré. Veuillez définir l'URL du serveur et la clé API dans les paramètres.
nl_nl: Plugin niet geconfigureerd. Stel Server URL en API-sleutel in bij instellingen.

source: API returned status code: %d
de_de: API hat Statuscode zurückgegeben: %d
fr_fr: L'API a renvoyé le code d'état : %d
nl_nl: API gaf statuscode: %d

source: Asset not found.
de_de: Foto nicht gefunden.
fr_fr: Photo introuvable.
nl_nl: Foto niet gevonden.

source: Video is not displayed.
de_de: Video wird nicht angezeigt.
fr_fr: La vidéo n'est pas affichée.
nl_nl: Video wordt niet weergegeven.

source: Gallery preview not available in editor. This will display on the published page.
de_de: Galerie-Vorschau im Editor nicht verfügbar. Dies wird auf der veröffentlichten Seite angezeigt.
fr_fr: Aperçu de la galerie non disponible dans l'éditeur. Cela s'affichera sur la page publiée.
nl_nl: Galerij voorbeeld niet beschikbaar in editor. Dit wordt weergegeven op de gepubliceerde pagina.

source: No photos found in this album.
de_de: Keine Fotos in diesem Album gefunden.
fr_fr: Aucune photo trouvée dans cet album.
nl_nl: Geen foto's gevonden in dit album.

source: Return to gallery
de_de: Zurück zur Galerie
fr_fr: Retour à la galerie
nl_nl: Terug naar galerij

source: Error from Immich API:
de_de: Fehler von Immich API:
fr_fr: Erreur de l'API Immich :
nl_nl: Fout van Immich API:

source: No albums found.
de_de: Keine Alben gefunden.
fr_fr: Aucun album trouvé.
nl_nl: Geen albums gevonden.

source: Select an album...
de_de: Wählen Sie ein Album aus...
fr_fr: Sélectionnez un album...
nl_nl: Selecteer een album...

source: Gallery name
de_de: Galeriename
fr_fr: Nom de la galerie
nl_nl: Galerijnaam

source: Gallery description
de_de: Galeriebeschreibung
fr_fr: Description de la galerie
nl_nl: Galerij omschrijving

source: Asset date
de_de: Fotodatum
fr_fr: Date de la photo
nl_nl: Foto datum

source: Asset description
de_de: Fotobeschreibung
fr_fr: Description de la photo
nl_nl: Foto omschrijving

source: Default
de_de: Standard
fr_fr: Par défaut
nl_nl: Standaard

source: Newest first
de_de: Neueste zuerst
fr_fr: Les plus récentes d'abord
nl_nl: Nieuwste eerst

source: Oldest first
de_de: Älteste zuerst
fr_fr: Les plus anciennes d'abord
nl_nl: Oudste eerst

source: A-Z (albums only)
de_de: A-Z (nur Alben)
fr_fr: A-Z (albums uniquement)
nl_nl: A-Z (alleen albums)

source: Z-A (albums only)
de_de: Z-A (nur Alben)
fr_fr: Z-A (albums uniquement)
nl_nl: Z-A (alleen albums)

source: A-Z by description (photos only)
de_de: A-Z nach Beschreibung (nur Fotos)
fr_fr: A-Z par description (photos uniquement)
nl_nl: A-Z op omschrijving (alleen foto's)

source: Z-A by description (photos only)
de_de: Z-A nach Beschreibung (nur Fotos)
fr_fr: Z-A par description (photos uniquement)
nl_nl: Z-A op omschrijving (alleen foto's)

source: Gallery Settings
de_de: Galerieeinstellungen
fr_fr: Paramètres de la galerie
nl_nl: Galerij instellingen

source: Display Mode
de_de: Anzeigemodus
fr_fr: Mode d'affichage
nl_nl: Weergavemodus

source: All albums overview
de_de: Alle Alben Übersicht
fr_fr: Aperçu de tous les albums
nl_nl: Alle albums overzicht

source: Single album
de_de: Einzelnes Album
fr_fr: Album unique
nl_nl: Enkel album

source: Multiple albums
de_de: Mehrere Alben
fr_fr: Plusieurs albums
nl_nl: Meerdere albums

source: Single photo
de_de: Einzelnes Foto
fr_fr: Photo unique
nl_nl: Enkele foto

source: Photo ID
de_de: Foto-ID
fr_fr: ID de la photo
nl_nl: Foto ID

source: Enter the photo ID from your Immich URL
de_de: Geben Sie die Foto-ID aus Ihrer Immich-URL ein
fr_fr: Entrez l'ID de la photo à partir de votre URL Immich
nl_nl: Voer het foto ID in van je Immich URL

source: Alignment
de_de: Ausrichtung
fr_fr: Alignement
nl_nl: Uitlijning

source: Default (none)
de_de: Standard (keine)
fr_fr: Par défaut (aucun)
nl_nl: Standaard (geen)

source: Left (text wraps right)
de_de: Links (Text fließt rechts)
fr_fr: Gauche (texte à droite)
nl_nl: Links (tekst loopt rechts)

source: Right (text wraps left)
de_de: Rechts (Text fließt links)
fr_fr: Droite (texte à gauche)
nl_nl: Rechts (tekst loopt links)

source: Center
de_de: Zentriert
fr_fr: Centré
nl_nl: Gecentreerd

source: Choose alignment for text wrapping around the photo
de_de: Wählen Sie die Ausrichtung für den Textumfluss um das Foto
fr_fr: Choisissez l'alignement pour l'habillage du texte autour de la photo
nl_nl: Kies uitlijning voor tekstomloop rond de foto

source: Select Album
de_de: Album auswählen
fr_fr: Sélectionner un album
nl_nl: Selecteer album

source: Select Albums
de_de: Alben auswählen
fr_fr: Sélectionner des albums
nl_nl: Selecteer albums

source: Sort Order
de_de: Sortierreihenfolge
fr_fr: Ordre de tri
nl_nl: Sorteervolgorde

source: Thumbnail Size
de_de: Vorschaubildgröße
fr_fr: Taille de la vignette
nl_nl: Miniatuurgrootte

source: Text Sizes
de_de: Textgrößen
fr_fr: Tailles de texte
nl_nl: Tekstgroottes

source: Title Size
de_de: Titelgröße
fr_fr: Taille du titre
nl_nl: Titelgrootte

source: Description Size
de_de: Beschreibungsgröße
fr_fr: Taille de la description
nl_nl: Omschrijvingsgrootte

source: Date Size
de_de: Datumgröße
fr_fr: Taille de la date
nl_nl: Datumgrootte

source: Display Options
de_de: Anzeigeoptionen
fr_fr: Options d'affichage
nl_nl: Weergaveopties

source: Loading albums...
de_de: Alben werden geladen...
fr_fr: Chargement des albums...
nl_nl: Albums laden...

source: ⚠️ No album selected
de_de: ⚠️ Kein Album ausgewählt
fr_fr: ⚠️ Aucun album sélectionné
nl_nl: ⚠️ Geen album geselecteerd

source: Please select an album from the sidebar to display.
de_de: Bitte wählen Sie ein Album aus der Seitenleiste aus.
fr_fr: Veuillez sélectionner un album dans la barre latérale à afficher.
nl_nl: Selecteer een album in de zijbalk om weer te geven.

source: ⚠️ No albums selected
de_de: ⚠️ Keine Alben ausgewählt
fr_fr: ⚠️ Aucun album sélectionné
nl_nl: ⚠️ Geen albums geselecteerd

source: Please select at least one album from the sidebar to display.
de_de: Bitte wählen Sie mindestens ein Album aus der Seitenleiste aus.
fr_fr: Veuillez sélectionner au moins un album dans la barre latérale à afficher.
nl_nl: Selecteer minstens één album in de zijbalk om weer te geven.

source: ⚠️ No photo ID entered
de_de: ⚠️ Keine Foto-ID eingegeben
fr_fr: ⚠️ Aucun ID de photo saisi
nl_nl: ⚠️ Geen foto-ID ingevoerd

source: Please enter a photo ID from your Immich server.
de_de: Bitte geben Sie eine Foto-ID von Ihrem Immich-Server ein.
fr_fr: Veuillez saisir un ID de photo de votre serveur Immich.
nl_nl: Voer een foto-ID in van je Immich server.

source: Will display all albums from Immich
de_de: Zeigt alle Alben von Immich an
fr_fr: Affichera tous les albums d'Immich
nl_nl: Toont alle albums van Immich

source: Single photo:
de_de: Einzelnes Foto:
fr_fr: Photo unique :
nl_nl: Enkele foto:

source: Selected:
de_de: Ausgewählt:
fr_fr: Sélectionné :
nl_nl: Geselecteerd:

source: Selected albums:
de_de: Ausgewählte Alben:
fr_fr: Albums sélectionnés :
nl_nl: Geselecteerde albums:

# block title
source: Gallery for Immich
de_de: Galerie für Immich
fr_fr: Galerie pour Immich
nl_nl: Galerij voor Immich

# block description
source: Display photos and albums from your Immich server
de_de: Zeigen Sie Fotos und Alben von Ihrem Immich-Server an
fr_fr: Affichez des photos et des albums depuis votre serveur Immich
nl_nl: Toon foto's en albums van je Immich server

# block keyword
source: gallery
de_de: galerie
fr_fr: galerie
nl_nl: galerij

# block keyword
source: photos
de_de: fotos
nl_nl: foto's

# block keyword
source: images
de_de: Bilder
nl_nl: afbeeldingen

source: Immich server URL
fr_fr: URL du serveur Immich
